ERM/src/DataProcessors/ПереносБалансовСLawsonНаOracleMI/ПереносБалансовСLawsonНаOracleMI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПереносБалансовСLawsonНаOracleMI</name>
</mdclass:DataProcessor>

ERM/src/InformationRegisters/СоответсвиеКорректировкиРегистровПроводки/СоответсвиеКорректировкиРегистровПроводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответсвиеКорректировкиРегистровПроводки</name>
  <attributes>
    <name>Inactive</name>
    <comment>Признак неактуальности записи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>КорректировкаРегистров</name>
    <type>
      <types>DocumentRef.КорректировкаРегистров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транзакция</name>
    <type>
      <types>String</types>
      <types>DocumentRef.ТранзакцияOracle</types>
      <types>DocumentRef.ПроводкаDSS</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/Enums/ТипыКорректировкиРегистров/ТипыКорректировкиРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКорректировкиРегистров</name>
  <comment>Register adjustment types</comment>
  <enumValues>
    <name>ПереносБалансовСLawsonНаOracle</name>
  </enumValues>
  <enumValues>
    <name>PaymentsLoading</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаDIR</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаRevenue</name>
  </enumValues>
  <enumValues>
    <name>КорректировкиHFM</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаXR242</name>
  </enumValues>
  <enumValues>
    <name>ПользовательскиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаJV</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Documents/КорректировкаРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КорректировкаРегистров</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.BilledAR</xr:Item>
				<xr:Item>AccumulationRegister.Payments</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedCash</xr:Item>
				<xr:Item>InformationRegister.ПериодыАктивностиДоговоров</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedMemo</xr:Item>
				<xr:Item>AccumulationRegister.ManualTransactions</xr:Item>
				<xr:Item>AccumulationRegister.UnbilledAR</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/DataProcessors/ПереносБалансовСLawsonНаOracleMI/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если Период = Дата(1,1,1) Тогда	
		ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(ТекущаяДата()), КонецМесяца(ТекущаяДата()));
	Иначе
		ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(Период), КонецМесяца(Период));
	КонецЕсли;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, ЭтаФорма.ПредставлениеПериода, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Период = РезультатВыбора.НачалоПериода;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировки(Команда)
	
	Результат = Истина;
	ВыполнитьПроверкуСуммНаКлиенте(Результат);
	
	Если Результат Тогда 
		СоздатьКорректировкиНаСервере();
		НайтиТранзакцииНаКлиенте();
	Иначе
		ТекстСообщения = НСтр("ru = 'Differences between the selected transactions is within than allowed. 
			|Balance transfer is possible!'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкиНаСервере()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Apply", Истина);
	ТЗ_ТранзакцииLawson = ТаблицаТранзакцийLawson.Выгрузить(Отбор, );
	ТЗ_ТранзакцииOracle = ТаблицаТранзакцийOracle.Выгрузить(Отбор, );
	 
	Если ТЗ_ТранзакцииLawson.Количество() > 0 ИЛИ ТЗ_ТранзакцииOracle.Количество() > 0 Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		НачатьТранзакцию();

		Док = Документы.КорректировкаРегистров.СоздатьДокумент();
		Док.ДополнительныеСвойства.Вставить("РазрешитьСозданиеДокументаБезРеверса", Истина);
		Док.Дата = КонецМесяца(Период);
		Док.ТипКорректировки = Перечисления.ТипыКорректировкиРегистров.ПереносБалансовСLawsonНаOracle;
		Док.ManagementGeomarket = ManagementGeomarket;
		Док.Комментарий = "Перенос Балансов С Lawson На Oracle";
		Док.Ответственный = Пользователи.ТекущийПользователь();
		Док.Записать();
		
		КорректировкаСсылка = Док.Ссылка;
		
		ТЗ_ТранзакцииLawson.Колонки.Добавить("КорректировкаРегистров");
		ТЗ_ТранзакцииLawson.ЗаполнитьЗначения(КорректировкаСсылка, "КорректировкаРегистров");
		
		ТЗ_ТранзакцииOracle.Колонки.Добавить("КорректировкаРегистров");
		ТЗ_ТранзакцииOracle.ЗаполнитьЗначения(КорректировкаСсылка, "КорректировкаРегистров");
		
		МассивТипов=Новый Массив();
		МассивТипов.Добавить(Тип("ДокументСсылка.ТранзакцияOracle"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ПроводкаDSS"));
		ТипыТранзакций = Новый ОписаниеТипов(МассивТипов); 
		
		ТЗ_Общая = Новый ТаблицаЗначений;
		ТЗ_Общая.Колонки.Добавить("Транзакция", ТипыТранзакций);
		ТЗ_Общая.Колонки.Добавить("КорректировкаРегистров", Новый ОписаниеТипов("ДокументСсылка.КорректировкаРегистров")); 
		
		//ТЗ_Общая = ТЗ_ТранзакцииOracle.Скопировать();
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТЗ_ТранзакцииLawson,ТЗ_Общая);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТЗ_ТранзакцииOracle,ТЗ_Общая);
		
		
		НЗ = РегистрыСведений.СоответсвиеКорректировкиРегистровПроводки.СоздатьНаборЗаписей();
		НЗ.Отбор.КорректировкаРегистров.Установить(КорректировкаСсылка);
		
		НЗ.Загрузить(ТЗ_Общая);
		
		НЗ.Записать(Истина);
		
		КорректировкаОбъект = КорректировкаСсылка.ПолучитьОбъект();
		
		//Для каждого СтрокаТранзакции Из ТЗ_ТранзакцииLawson Цикл
		//	НоваяЗапись = НЗ.Добавить();
		//	НоваяЗапись.КорректировкаРегистров = КорректировкаСсылка;
		//	НоваяЗапись.Транзакция = СтрокаТранзакции.Транзакция;
		//КонецЦикла;

		Для Каждого СтрокаТранзакции Из ТЗ_ТранзакцииOracle Цикл
			ТранзакцияОбъект = СтрокаТранзакции.Транзакция.ПолучитьОбъект();
			КоллекцияДвижений = ТранзакцияОбъект.Движения;
			
			Для каждого НаборЗаписей Из КоллекцияДвижений Цикл
				МетаданныеНабораЗаписей = Метаданные.НайтиПоТипу(ТипЗнч(НаборЗаписей));
				Если НЕ Метаданные.РегистрыНакопления.Содержит(МетаданныеНабораЗаписей) Тогда
					Продолжить;
				КонецЕсли;
				НаборЗаписей.Прочитать();
				Для каждого ДвижениеТранзакции Из НаборЗаписей Цикл
					НовоеДвижение = Док.Движения[МетаданныеНабораЗаписей.Имя].Добавить();
					ЗаполнитьЗначенияСвойств(НовоеДвижение, ДвижениеТранзакции);
					НовоеДвижение.Период = Док.Дата;
					Для каждого Ресурс Из МетаданныеНабораЗаписей.Ресурсы Цикл
						НовоеДвижение[Ресурс.Имя] = -НовоеДвижение[Ресурс.Имя];
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			//Для каждого ДвижениеТранзакции Из КоллекцияДвижений.BilledAR Цикл
			//	НовоеДвижение = Док.Движения.BilledAR.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовоеДвижение, ДвижениеТранзакции);
			//	НовоеДвижение.Период = Док.Дата;
			//	НовоеДвижение.Amount = -НовоеДвижение.Amount;
			//	НовоеДвижение.BaseAmount = -НовоеДвижение.BaseAmount;
			//КонецЦикла;
			//Для каждого ДвижениеТранзакции Из КоллекцияДвижений.UnbilledAR Цикл
			//	НовоеДвижение = Док.Движения.UnbilledAR.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовоеДвижение, ДвижениеТранзакции);
			//	НовоеДвижение.Период = Док.Дата;
			//	НовоеДвижение.Amount = -НовоеДвижение.Amount;
			//	НовоеДвижение.BaseAmount = -НовоеДвижение.BaseAmount;
			//КонецЦикла;
			//Для каждого ДвижениеТранзакции Из КоллекцияДвижений.UnallocatedCash Цикл
			//	НовоеДвижение = Док.Движения.UnallocatedCash.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовоеДвижение, ДвижениеТранзакции);
			//	НовоеДвижение.Период = Док.Дата;
			//	НовоеДвижение.Amount = -НовоеДвижение.Amount;
			//	НовоеДвижение.BaseAmount = -НовоеДвижение.BaseAmount;
			//КонецЦикла;
			//Для каждого ДвижениеТранзакции Из КоллекцияДвижений.ManualTransactions Цикл
			//	НовоеДвижение = Док.Движения.ManualTransactions.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовоеДвижение, ДвижениеТранзакции);
			//	НовоеДвижение.Период = Док.Дата;
			//	НовоеДвижение.Amount = -НовоеДвижение.Amount;
			//	НовоеДвижение.BaseAmount = -НовоеДвижение.BaseAmount;
			//КонецЦикла;
			//Для каждого ДвижениеТранзакции Из КоллекцияДвижений.UnallocatedMemo Цикл
			//	НовоеДвижение = Док.Движения.UnallocatedMemo.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовоеДвижение, ДвижениеТранзакции);
			//	НовоеДвижение.Период = Док.Дата;
			//	НовоеДвижение.Amount = -НовоеДвижение.Amount;
			//	НовоеДвижение.BaseAmount = -НовоеДвижение.BaseAmount;
			//КонецЦикла;
			//Для каждого ДвижениеТранзакции Из КоллекцияДвижений.Payments Цикл
			//	НовоеДвижение = Док.Движения.Payments.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовоеДвижение, ДвижениеТранзакции);
			//	НовоеДвижение.Период = Док.Дата;
			//	НовоеДвижение.Amount = -НовоеДвижение.Amount;
			//	//Движение.BaseAmount = -Движение.BaseAmount;
			//КонецЦикла;
			//Для каждого ДвижениеТранзакции Из КоллекцияДвижений.Revenue Цикл
			//	НовоеДвижение = Док.Движения.Revenue.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовоеДвижение, ДвижениеТранзакции);
			//	НовоеДвижение.Период = Док.Дата;
			//	НовоеДвижение.Amount = -НовоеДвижение.Amount;
			//	НовоеДвижение.BaseAmount = -НовоеДвижение.BaseAmount;
			//КонецЦикла;
			//Для каждого ДвижениеТранзакции Из КоллекцияДвижений.InvoicedDebts Цикл
			//	НовоеДвижение = Док.Движения.InvoicedDebts.Добавить();
			//	ЗаполнитьЗначенияСвойств(НовоеДвижение, ДвижениеТранзакции);
			//	НовоеДвижение.Период = Док.Дата;
			//	НовоеДвижение.Amount = -НовоеДвижение.Amount;
			//	НовоеДвижение.BaseAmount = -НовоеДвижение.BaseAmount;
			//КонецЦикла;

			
			
			
			
			
			
		КонецЦикла;
		
		Если Док.Движения.UnbilledAR.Количество() > 0 Тогда
			
			СтрокаТаблицыРегистров = Док.ТаблицаРегистров.Добавить();
			СтрокаТаблицыРегистров.Имя = "UnbilledAR";
			
			Док.Движения.UnbilledAR.Записывать = Истина;
			
		КонецЕсли;
		
		Если Док.Движения.BilledAR.Количество() > 0 Тогда
			
			СтрокаТаблицыРегистров = Док.ТаблицаРегистров.Добавить();
			СтрокаТаблицыРегистров.Имя = "BilledAR";
			
			Док.Движения.BilledAR.Записывать = Истина;
			
		КонецЕсли;
		
		Если Док.Движения.UnallocatedCash.Количество() > 0 Тогда
			
			СтрокаТаблицыРегистров = Док.ТаблицаРегистров.Добавить();
			СтрокаТаблицыРегистров.Имя = "UnallocatedCash";
			
			Док.Движения.UnallocatedCash.Записывать = Истина;
			
		КонецЕсли;
		
		Если Док.Движения.ManualTransactions.Количество() > 0 Тогда
			
			СтрокаТаблицыРегистров = Док.ТаблицаРегистров.Добавить();
			СтрокаТаблицыРегистров.Имя = "ManualTransactions";
			
			Док.Движения.ManualTransactions.Записывать = Истина;
			
		КонецЕсли;
		
		Если Док.Движения.UnallocatedMemo.Количество() > 0 Тогда
			
			СтрокаТаблицыРегистров = Док.ТаблицаРегистров.Добавить();
			СтрокаТаблицыРегистров.Имя = "UnallocatedMemo";
			
			Док.Движения.UnallocatedMemo.Записывать = Истина;
			
		КонецЕсли;
		
		Если Док.Движения.Payments.Количество() > 0 Тогда
			
			СтрокаТаблицыРегистров = Док.ТаблицаРегистров.Добавить();
			СтрокаТаблицыРегистров.Имя = "Payments";
			
			Док.Движения.Payments.Записывать = Истина;
			
		КонецЕсли;
		
		Если Док.Движения.Revenue.Количество() > 0 Тогда
			
			СтрокаТаблицыРегистров = Док.ТаблицаРегистров.Добавить();
			СтрокаТаблицыРегистров.Имя = "Revenue";
			
			Док.Движения.Revenue.Записывать = Истина;
			
		КонецЕсли;
		
		Если Док.Движения.InvoicedDebts.Количество() > 0 Тогда
			
			СтрокаТаблицыРегистров = Док.ТаблицаРегистров.Добавить();
			СтрокаТаблицыРегистров.Имя = "InvoicedDebts";
			
			Док.Движения.InvoicedDebts.Записывать = Истина;
			
		КонецЕсли;
		
		Док.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Иначе
		//ругаться, что ничего не выбрано
	КонецЕсли;
		
		
КонецПроцедуры

&НаКлиенте
Процедура НайтиТранзакции(Команда)
	
	НайтиТранзакцииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиТранзакцииНаКлиенте()
	
	ИтоговаяСуммаLawson = 0;
	ИтоговаяСуммаOracle = 0;
	
	Результат = НайтиТранзакцииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция НайтиТранзакцииНаСервере()
	
	ТранзакцииLawson = Обработки.ПереносБалансовСLawsonНаOracleMI.НайтиТранзакцииLawson(Период, ВидСчета, ManagementGeomarket);
	ТранзакцииOracle = Обработки.ПереносБалансовСLawsonНаOracleMI.НайтиТранзакцииOracle(Период, ВидСчета, ManagementGeomarket);
	
	ТаблицаТранзакцийLawson.Загрузить(ТранзакцииLawson);
	ТаблицаТранзакцийOracle.Загрузить(ТранзакцииOracle);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПроверкуСумм(Команда)
	
	Результат = Истина;
	ВыполнитьПроверкуСуммНаКлиенте(Результат);
	
	Если Результат Тогда 
		ТекстСообщения = НСтр("ru = 'Differences between the selected transactions is within than allowed. 
			|Balance transfer is possible!'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуСуммНаКлиенте(Результат = Истина)

	Если Макс(ИтоговаяСуммаLawson - ИтоговаяСуммаOracle, ИтоговаяСуммаOracle - ИтоговаяСуммаLawson) > ДопустимоеОтклонениеСумм Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Если НЕ Результат Тогда
		ТекстСообщения = НСтр("ru = 'Differences between selected transactions are more than possible.'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТранзакцийLawsonApplyПриИзменении(Элемент)
	
	Если Элементы.ТаблицаТранзакцийLawson.ТекущиеДанные.ЕстьКорректировка Тогда
		Элементы.ТаблицаТранзакцийLawson.ТекущиеДанные.Apply = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаТранзакцийLawson.ТекущиеДанные.Apply Тогда
		ИтоговаяСуммаLawson = ИтоговаяСуммаLawson + Элементы.ТаблицаТранзакцийLawson.ТекущиеДанные.BaseAmount;
	Иначе
		ИтоговаяСуммаLawson = ИтоговаяСуммаLawson - Элементы.ТаблицаТранзакцийLawson.ТекущиеДанные.BaseAmount;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТранзакцийOracleApplyПриИзменении(Элемент)
	
	Если Элементы.ТаблицаТранзакцийOracle.ТекущиеДанные.ЕстьКорректировка Тогда
		Элементы.ТаблицаТранзакцийOracle.ТекущиеДанные.Apply = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаТранзакцийOracle.ТекущиеДанные.Apply Тогда
		ИтоговаяСуммаOracle = ИтоговаяСуммаOracle + Элементы.ТаблицаТранзакцийOracle.ТекущиеДанные.BaseAmount;
	Иначе
		ИтоговаяСуммаOracle = ИтоговаяСуммаOracle - Элементы.ТаблицаТранзакцийOracle.ТекущиеДанные.BaseAmount;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиLawson(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаТранзакцийLawson Цикл
		Если Элементы.ТаблицаТранзакцийLawson.ПроверитьСтроку(СтрокаТаблицы.ПолучитьИдентификатор()) Тогда
			Если НЕ СтрокаТаблицы.Apply И НЕ СтрокаТаблицы.ЕстьКорректировка Тогда
				СтрокаТаблицы.Apply = Истина;
				ИтоговаяСуммаLawson = ИтоговаяСуммаLawson + СтрокаТаблицы.BaseAmount;
			КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиLawson(Команда)
	
	Для каждого СтрокаТаблицы Из ТаблицаТранзакцийLawson Цикл
		Если СтрокаТаблицы.Apply Тогда
			СтрокаТаблицы.Apply = Ложь;
			ИтоговаяСуммаLawson = ИтоговаяСуммаLawson - СтрокаТаблицы.BaseAmount;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиOracle(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаТранзакцийOracle Цикл
		Если Элементы.ТаблицаТранзакцийOracle.ПроверитьСтроку(СтрокаТаблицы.ПолучитьИдентификатор()) Тогда
			Если НЕ СтрокаТаблицы.Apply  И НЕ СтрокаТаблицы.ЕстьКорректировка Тогда
				СтрокаТаблицы.Apply = Истина;
				ИтоговаяСуммаOracle = ИтоговаяСуммаOracle + СтрокаТаблицы.BaseAmount;
			КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиOracle(Команда)
	
	Для каждого СтрокаТаблицы Из ТаблицаТранзакцийOracle Цикл
		Если СтрокаТаблицы.Apply Тогда
			СтрокаТаблицы.Apply = Ложь;
			ИтоговаяСуммаOracle = ИтоговаяСуммаOracle - СтрокаТаблицы.BaseAmount;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
